# Домашнее задание по теме: MySQL

## Подготовка

Установка `MySQL Community Server` + `MySQL Workbench`:

- [MySQL Community Server](https://dev.mysql.com/downloads/mysql/)
    
- [MySQL Workbench](https://dev.mysql.com/downloads/workbench/)

In [1]:
# ВНИМАНИЕ: необходимо удостовериться, что виртуальная среда выбрана правильно!

# для Linux
# !which pip

# для Windows
!pip -V

pip 20.3.3 from C:\Users\ASUS\anaconda3\envs\LevelUp_DS\lib\site-packages\pip (python 3.8)

In [2]:
# установка необходимых пакетов
!conda install SQLAlchemy pymysql -y

Collecting package metadata (current_repodata.json): ...working... done
Solving environment: ...working... done

# All requested packages already installed.

In [ ]:
# импорт необходимых пакетов
import pandas as pd
from sqlalchemy import create_engine
import sqlalchemy

In [10]:
# данные для подключения к серверу MySQL
user='root'
password='15901590'
host='127.0.0.1'
port='3306'

In [17]:
# создать новый экземпляр класса sqlalchemy.engine.Engine, который предоставляет подключение к серверу MySQL
engine = create_engine(f"mysql+pymysql://{user}:{password}@{host}:{port}")
engine

Engine(mysql+pymysql://root:***@127.0.0.1:3306)

## ERR Model

<img src="images/eer_model_hw.png"/>

## Создание БД

In [21]:
db_name='store_db'
with engine.connect() as connection:
    connection.execute(f'DROP DATABASE IF EXISTS {db_name}')    
    connection.execute(f'CREATE DATABASE {db_name}')            
    connection.execute(f'USE {db_name}')

## Создание таблиц

In [22]:
# items
with engine.connect() as connection:
    connection.execute("""CREATE TABLE items ( 
                        id INT UNSIGNED NOT NULL AUTO_INCREMENT, 
                        name VARCHAR(20) NOT NULL, 
                        type ENUM('dry', 'wet') NOT NULL, 
                        expiration_date DATE NOT NULL, 
                        PRIMARY KEY(id))""")

In [23]:
# categories
with engine.connect() as connection:
    connection.execute("""CREATE TABLE categories ( 
                        id INT UNSIGNED NOT NULL AUTO_INCREMENT, 
                        name VARCHAR(50) NOT NULL, 
                        PRIMARY KEY(id))""")

In [26]:
# prices
with engine.connect() as connection:
    connection.execute("""CREATE TABLE prices (
                        items_id INT UNSIGNED NOT NULL, 
                        price FLOAT NOT NULL,
                        FOREIGN KEY (items_id) 
                        REFERENCES items(id) 
                        ON DELETE CASCADE 
                        ON UPDATE CASCADE)""")

In [27]:
# items_categories
with engine.connect() as connection:
    connection.execute("""CREATE TABLE items_categories (
                        category_id INT UNSIGNED NOT NULL, 
                        item_id INT UNSIGNED NOT NULL,
                        FOREIGN KEY (category_id) 
                        REFERENCES categories(id) 
                        ON DELETE CASCADE 
                        ON UPDATE CASCADE,
                        FOREIGN KEY (item_id) 
                        REFERENCES items(id) 
                        ON DELETE CASCADE 
                        ON UPDATE CASCADE
                        )""")

## Заполнение таблиц

(Самостоятельно придумать данные для заполнения, это не имеет значения. 5-15 значений в каждой таблице)

In [28]:
# items
with engine.connect() as connection:
    connection.execute("""INSERT INTO items (name, type, expiration_date) VALUES 
                        ('Whiskas', 'dry', '2021-05-20'), 
                        ('RoyalCanin', 'wet', '2022-06-25'), 
                        ('Chappi', 'dry', '2025-05-20'), 
                        ('Ceasar', 'wet', '2023-10-10'), 
                        ('Felix', 'dry', '2023-10-5'), 
                        ('Prolife', 'wet', '2026-02-8'), 
                        ('Sheba', 'dry', '2021-06-16'), 
                        ('Simba', 'dry', '2025-09-19')""")

In [29]:
# categories
with engine.connect() as connection:
    connection.execute("""INSERT INTO categories (name) VALUES 
                        ('Dogs'), 
                        ('Cats'), 
                        ('Kittens'), 
                        ('Puppies')""")

In [30]:
# prices
with engine.connect() as connection:
    connection.execute("""INSERT INTO prices (items_id, price) VALUES 
                        ('1', '123.55'), 
                        ('2', '346.85'), 
                        ('3', '876.67'), 
                        ('4', '445.10'), 
                        ('5', '988.50'), 
                        ('6', '110.09'), 
                        ('7', '678.77'),
                        ('8', '345.77')""")

In [31]:
# items_categories
with engine.connect() as connection:
    connection.execute("""INSERT INTO items_categories (category_id, item_id) VALUES 
                        ('1', '1'), 
                        ('2', '2'), 
                        ('3', '3'), 
                        ('4', '4'), 
                        ('1', '5'), 
                        ('2', '6'), 
                        ('3', '7'),
                        ('4', '8')""")

## Проверка заполнения таблиц

(Вывести данные, которые были записаны в таблицы)

In [32]:
# items
items = pd.read_sql_query("""SELECT * FROM items""", engine)
items

   id        name type expiration_date
0   1     Whiskas  dry      2021-05-20
1   2  RoyalCanin  wet      2022-06-25
2   3      Chappi  dry      2025-05-20
3   4      Ceasar  wet      2023-10-10
4   5       Felix  dry      2023-10-05
5   6     Prolife  wet      2026-02-08
6   7       Sheba  dry      2021-06-16
7   8       Simba  dry      2025-09-19

In [33]:
# categories
categories = pd.read_sql_query("""SELECT * FROM categories""", engine)
categories

   id     name
0   1     Dogs
1   2     Cats
2   3  Kittens
3   4  Puppies

In [34]:
# prices
prices = pd.read_sql_query("""SELECT * FROM prices""", engine)
prices

   items_id   price
0         1  123.55
1         2  346.85
2         3  876.67
3         4  445.10
4         5  988.50
5         6  110.09
6         7  678.77
7         8  345.77

In [35]:
# items_categories
items_categories = pd.read_sql_query("""SELECT * FROM items_categories""", engine)
items_categories

   category_id  item_id
0            1        1
1            2        2
2            3        3
3            4        4
4            1        5
5            2        6
6            3        7
7            4        8

## Обновление данных

In [36]:
# изменить одно наименование (name) товара
with engine.connect() as connection:
    connection.execute("""UPDATE items SET name='Winner' WHERE id=1""")

In [37]:
# проверить, что наименование изменилось
items = pd.read_sql_query("""SELECT * FROM items""", engine)
items

   id        name type expiration_date
0   1      Winner  dry      2021-05-20
1   2  RoyalCanin  wet      2022-06-25
2   3      Chappi  dry      2025-05-20
3   4      Ceasar  wet      2023-10-10
4   5       Felix  dry      2023-10-05
5   6     Prolife  wet      2026-02-08
6   7       Sheba  dry      2021-06-16
7   8       Simba  dry      2025-09-19

## Удаление данных

In [38]:
# удалить один товар с условием
with engine.connect() as connection:
    connection.execute("""DELETE FROM items WHERE name='Simba'""")

In [39]:
# проверить, что наименование товар был удален из таблицы items
items = pd.read_sql_query("""SELECT * FROM items""", engine)
items

   id        name type expiration_date
0   1      Winner  dry      2021-05-20
1   2  RoyalCanin  wet      2022-06-25
2   3      Chappi  dry      2025-05-20
3   4      Ceasar  wet      2023-10-10
4   5       Felix  dry      2023-10-05
5   6     Prolife  wet      2026-02-08
6   7       Sheba  dry      2021-06-16

In [40]:
# проверить, что наименование товар был удален из таблицы items_categories
items_categories = pd.read_sql_query("""SELECT * FROM items_categories""", engine)
items_categories

   category_id  item_id
0            1        1
1            2        2
2            3        3
3            4        4
4            1        5
5            2        6
6            3        7

In [41]:
# проверить, что наименование товар был удален из таблицы prices
prices = pd.read_sql_query("""SELECT * FROM prices""", engine)
prices

   items_id   price
0         1  123.55
1         2  346.85
2         3  876.67
3         4  445.10
4         5  988.50
5         6  110.09
6         7  678.77

In [ ]:
## ERR Model

<img src="images/eer_model_hw.png"/>

## Получение данных (с условиями)

In [44]:
n = 300 # выбрать n
# вывести все данные из таблицы prices, где price больше n
prices = pd.read_sql_query(f"""SELECT * FROM prices WHERE price>{n}""", engine)
prices

   items_id   price
0         2  346.85
1         3  876.67
2         4  445.10
3         5  988.50
4         7  678.77

In [46]:
n = 600 # выбрать n
nid = 5 # выбрать nid
# вывести все данные из таблицы prices, где price больше n И item_id не равен nid
prices = pd.read_sql_query(f"""SELECT * FROM prices WHERE price>{n} AND items_id != {nid}""", engine)
prices

   items_id   price
0         3  876.67
1         7  678.77

In [52]:
first_syms = 'C' # выбрать символы (буква или несколько букв)
# вывести все данные из таблицы items, где name начинается с first_syms
items = pd.read_sql_query(f"""SELECT * FROM items WHERE name LIKE '{first_syms}%%'""", engine)
items

   id    name type expiration_date
0   3  Chappi  dry      2025-05-20
1   4  Ceasar  wet      2023-10-10

In [55]:
last_sym = 'a' # выбрать символ (буква)
item_type = 'dry' # выбрать тип

# объединить результаты запросов (повторения допускаются):
# name, type из items, где name заканчивается символом last_sym
# name, type из items, где type равен item_type
items = pd.read_sql_query(f"""SELECT name, type FROM items WHERE name LIKE '%%{last_sym}'
                              UNION ALL
                              SELECT name, type FROM items WHERE type = '{item_type}'""", engine)
items

     name type
0   Sheba  dry
1  Winner  dry
2  Chappi  dry
3   Felix  dry
4   Sheba  dry

In [57]:
# вывести name, type из items и price из prices
# указывать только товары содержащие цены и не должно быть цен без товаров
items = pd.read_sql_query("""SELECT items.name, items.type, prices.price FROM items JOIN prices
                              ON items.id = prices.items_id""", engine)
items

         name type   price
0      Winner  dry  123.55
1  RoyalCanin  wet  346.85
2      Chappi  dry  876.67
3      Ceasar  wet  445.10
4       Felix  dry  988.50
5     Prolife  wet  110.09
6       Sheba  dry  678.77

In [58]:
# вывести name, type из items и price из prices
# могут быть товары, у которых нет цены
items = pd.read_sql_query("""SELECT items.name, items.type, prices.price FROM items LEFT JOIN prices
                              ON items.id = prices.items_id""", engine)
items

         name type   price
0      Winner  dry  123.55
1  RoyalCanin  wet  346.85
2      Chappi  dry  876.67
3      Ceasar  wet  445.10
4       Felix  dry  988.50
5     Prolife  wet  110.09
6       Sheba  dry  678.77

In [59]:
# получить среднюю цену
price = pd.read_sql_query("""SELECT AVG(price) FROM prices""", engine)
price

   AVG(price)
0  509.932859

In [ ]:
# получить id товаров и цену для товаров, у которых цена < средней цены
items = pd.read_sql_query("""SELECT items.id, prices.price FROM items JOIN prices
                              ON items.id = prices.items_id
                              WHERE prices.price<(SELECT AVG(price) FROM prices)""", engine)
items